Ran Plan for dir: `eu-central-1/production` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecr_repository.elite_airflow will be created
+ resource "aws_ecr_repository" "elite_airflow" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "elite-airflow"
      + region               = "eu-central-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"        = "elite-airflow"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all             = {
          + "Name"        = "elite-airflow"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_role.sftp_user_role will be created
+ resource "aws_iam_role" "sftp_user_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sftp_user"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "tag-key" = "sftp-user"
        }
      + tags_all              = {
          + "tag-key" = "sftp-user"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.sftp_user_policy will be created
+ resource "aws_iam_role_policy" "sftp_user_policy" {
      + id          = (known after apply)
      + name        = "sftp_user_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sftp_user"
    }

  # aws_internet_gateway.elite-gateway will be created
+ resource "aws_internet_gateway" "elite-gateway" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "eu-central-1"
      + tags     = {
          + "Name"        = "elite-vpc-internet-gateway"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all = {
          + "Name"        = "elite-vpc-internet-gateway"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_internet_gateway.secure-production-igw will be created
+ resource "aws_internet_gateway" "secure-production-igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "eu-central-1"
      + tags     = {
          + "Name"        = "secure-production-igw"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all = {
          + "Name"        = "secure-production-igw"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.public-route will be created
+ resource "aws_route" "public-route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "eu-central-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private-rtb will be created
+ resource "aws_route_table" "private-rtb" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-central-1"
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "secure-production-private-rt"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "secure-production-private-rt"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private-subnet-rtb will be created
+ resource "aws_route_table" "private-subnet-rtb" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-central-1"
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "elite-vpc-private-subnet-rtb"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "elite-vpc-private-subnet-rtb"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public-rtb will be created
+ resource "aws_route_table" "public-rtb" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-central-1"
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "secure-production-public-rt"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "secure-production-public-rt"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public-subnet-rtb will be created
+ resource "aws_route_table" "public-subnet-rtb" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-central-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "elite-vpc-public-subnet-rtb"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Name"        = "elite-vpc-public-subnet-rtb"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private-rtb-a will be created
+ resource "aws_route_table_association" "private-rtb-a" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-rtb-b will be created
+ resource "aws_route_table_association" "private-rtb-b" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private-rtb-c will be created
+ resource "aws_route_table_association" "private-rtb-c" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_subnet_associations will be created
+ resource "aws_route_table_association" "private_subnet_associations" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-rtb-a will be created
+ resource "aws_route_table_association" "public-rtb-a" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-rtb-b will be created
+ resource "aws_route_table_association" "public-rtb-b" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public-rtb-c will be created
+ resource "aws_route_table_association" "public-rtb-c" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_subnet_associations will be created
+ resource "aws_route_table_association" "public_subnet_associations" {
      + id             = (known after apply)
      + region         = "eu-central-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_s3_bucket.alpen_storage will be created
+ resource "aws_s3_bucket" "alpen_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "alpen-mechanik"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "alpen_mechanik"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "alpen_mechanik"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.block_access will be created
+ resource "aws_s3_bucket_public_access_block" "block_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-central-1"
      + restrict_public_buckets = true
    }

  # aws_security_group.elite-sg will be created
+ resource "aws_security_group" "elite-sg" {
      + arn                    = (known after apply)
      + description            = "security group for the VPC"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "secure-elite-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-central-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "elite-vpc-sg"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Name"        = "elite-vpc-sg"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.secure-production-sg will be created
+ resource "aws_security_group" "secure-production-sg" {
      + arn                    = (known after apply)
      + description            = "Dedicated security group for the VPC"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "secure-production-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-central-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.elite-private-a will be created
+ resource "aws_subnet" "elite-private-a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.8.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "elite-secure-production-private-a"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "elite-secure-production-private-a"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elite-private-b will be created
+ resource "aws_subnet" "elite-private-b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.24.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "elite-secure-production-private-b"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "elite-secure-production-private-b"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elite-private-c will be created
+ resource "aws_subnet" "elite-private-c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.40.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "elite-secure-production-private-c"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "elite-secure-production-private-c"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elite-public-a will be created
+ resource "aws_subnet" "elite-public-a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.0.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "elite-secure-production-public-a"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "elite-secure-production-public-a"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elite-public-b will be created
+ resource "aws_subnet" "elite-public-b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.16.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "elite-secure-production-public-b"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "elite-secure-production-public-b"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.elite-public-c will be created
+ resource "aws_subnet" "elite-public-c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.16.32.0/21"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "elite-secure-production-public-c"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "elite-secure-production-public-c"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private-subnet will be created
+ resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "secure-production-private"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "secure-production-private"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public-subnet will be created
+ resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-central-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-central-1"
      + tags                                           = {
          + "Name"        = "secure-production-public"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                                       = {
          + "Name"        = "secure-production-public"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_transfer_server.alpen_server will be created
+ resource "aws_transfer_server" "alpen_server" {
      + arn                         = (known after apply)
      + domain                      = "S3"
      + endpoint                    = (known after apply)
      + endpoint_type               = "PUBLIC"
      + force_destroy               = false
      + host_key_fingerprint        = (known after apply)
      + id                          = (known after apply)
      + identity_provider_type      = "SERVICE_MANAGED"
      + protocols                   = [
          + "SFTP",
        ]
      + region                      = "eu-central-1"
      + security_policy_name        = "TransferSecurityPolicy-2018-11"
      + sftp_authentication_methods = (known after apply)
      + tags                        = {
          + "Name" = "Alpen_SFTP_Server"
        }
      + tags_all                    = {
          + "Name" = "Alpen_SFTP_Server"
        }

      + protocol_details (known after apply)

      + s3_storage_options (known after apply)
    }

  # aws_transfer_ssh_key.server_key will be created
+ resource "aws_transfer_ssh_key" "server_key" {
      + body       = (known after apply)
      + id         = (known after apply)
      + region     = "eu-central-1"
      + server_id  = (known after apply)
      + ssh_key_id = (known after apply)
      + user_name  = "vendor"
    }

  # aws_transfer_user.vendor will be created
+ resource "aws_transfer_user" "vendor" {
      + arn                 = (known after apply)
      + home_directory_type = "LOGICAL"
      + id                  = (known after apply)
      + region              = "eu-central-1"
      + role                = (known after apply)
      + server_id           = (known after apply)
      + tags_all            = (known after apply)
      + user_name           = "vendor"

      + home_directory_mappings {
          + entry  = "/"
          + target = (known after apply)
        }
    }

  # aws_vpc.elite-vpc will be created
+ resource "aws_vpc" "elite-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.16.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "eu-central-1"
      + tags                                 = {
          + "Name"        = "elite-secure-production"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                             = {
          + "Name"        = "elite-secure-production"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
    }

  # aws_vpc.federated-engineers-vpc will be created
+ resource "aws_vpc" "federated-engineers-vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "eu-central-1"
      + tags                                 = {
          + "Name"        = "secure-production"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                             = {
          + "Name"        = "secure-production"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
    }

  # aws_vpc_endpoint.production_s3_gateway will be created
+ resource "aws_vpc_endpoint" "production_s3_gateway" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + region                = "eu-central-1"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name"        = "production_s3_gateway"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all              = {
          + "Name"        = "production_s3_gateway"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3_gateway will be created
+ resource "aws_vpc_endpoint" "s3_gateway" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + region                = "eu-central-1"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-central-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name"        = "s3-vpc-endpoint"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all              = {
          + "Name"        = "s3-vpc-endpoint"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4 will be created
+ resource "aws_vpc_security_group_egress_rule" "allow_all_traffic_ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-central-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # aws_vpc_security_group_egress_rule.elite-sg-egress will be created
+ resource "aws_vpc_security_group_egress_rule" "elite-sg-egress" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-central-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # tls_private_key.sftp_ssh_key will be created
+ resource "tls_private_key" "sftp_ssh_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.injest_bucket.aws_s3_bucket.federated-engineers-bucket will be created
+ resource "aws_s3_bucket" "federated-engineers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "federated-engineers-production-elite-data-lake"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "federated-engineers-production-elite-data-lake"
          + "Service"     = "airflow"
          + "environment" = "production"
          + "team"        = "elite"
          + "terraform"   = "true"
        }
      + tags_all                    = {
          + "Name"        = "federated-engineers-production-elite-data-lake"
          + "Service"     = "airflow"
          + "environment" = "production"
          + "team"        = "elite"
          + "terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.injest_bucket.aws_s3_bucket_versioning.versioning will be created
+ resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 42 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ sftp_private_key = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d eu-central-1/production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://161.97.80.18:4141/lock?id=Federated-Engineers%252Felite-cloud-infrastructures%252Feu-central-1%252Fproduction%252Fdefault%252F)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d eu-central-1/production
  ```
Plan: 42 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```